app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @ratings = params['ratings']
    if @ratings == nil
      @movies = Movie.find(:all, :order => params[:order])
    else
       @ratings = @ratings.keys
       @movies = Movie.find(:all, :conditions =>{:rating => (@ratings == [] ? @all_ratings : @ratings)}, :order => params[:order])
---
SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1'
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date